# 1. Используем официальный образ Node.js
FROM node:18-alpine

# Устанавливаем рабочую директорию в контейнере
WORKDIR /app

# Копируем package.json бэкенда и устанавливаем его зависимости
COPY package*.json ./
RUN npm install

# Копируем исходный код бэкенда и папку фронтенда
COPY . .

# Переходим в папку фронтенда, устанавливаем его зависимости и собираем его
# Результат сборки Vite автоматически запишется в папку /app/public
RUN cd frontend && npm install && npm run build

# Удаляем исходные файлы фронтенда из контейнера для экономии места
RUN rm -rf frontend

# Указываем порт, который слушает приложение
EXPOSE 5000

# Запуск бэкенд сервера
CMD ["npm", "start"]